export const RU = {
  TITLE: "EpocketCash",
  PROFILE: "Профиль",
  CASHOUT: "Обналичить",
  SHOP: "Торговый\nцентр",
  HISTORY: "История",
  INFO: "Инфо",
  LOCATION_DISABLED: "Геолокация\nотключена",
  LOCATION_ENABLE: "ВКЛЮЧИТЬ ГЕОЛОКАЦИЮ",
  SIGN_UP_TITLE: "Регистрация",
  GO_TO_SIGNIN: "У МЕНЯ УЖЕ ЕСТЬ УЧЕТНАЯ ЗАПИСЬ",
  START_TITLE: "Зарабатывайте проводя время\nв торговом центре",
  MOBILE_NUMBER: "Введите ваш номер телефона",
  ENTER_NAME: "Введите ваше имя",
  FIRST_LAST_NAME: "Давайте познакомимся",
  SIGN_UP: "Зарегистрироваться",
  SIGN_IN: "Войти",
  NAMES: "Имя Фамилия",
  PHONE_MASK: "- -  - - -  - -  - -",
  ACCEPT: "ПОДТВЕРДИТЬ",
  CODE_SENT: "На ваш номер телефона отправлен 6-ти значный код",
  ENTER_CODE: "Введите его для подтверждения регистрации",
  ENTER_CODE_SIDN_IN: "Введите его для подтверждения входа",
  CHECK_CODE: "Проверьте правильность кода",
  CODE_MASK: "- - - - - -",
  SING_UP_SUCCESS: "Регистрация прошла успешно!",
  USE_YOUR_PHONE: "Используйте ваш номер телефона для входа в приложение",
  OK: "OK",
  REPEAT: "Повторить",
  SIGN_IN_TITLE: "Вход",
  NUMBER_EXISTS: "Данный номер уже есть в базе",
  NUMBER_NOT_EXISTS: "Данного номера нет в базе. Зарегистрируйтесь",
  SOME_ERROR: "Что-то пошло не так :(",
  YOU_ARE_HERE: "Вы тут:",
  YOUR_BONUS: "Ваши бонусы:",
  EPC: "epc",
  FOR_BEING_IN_MALL: "За пребывание в ТРЦ",
  TIME_STARTED: "Время пошло...",
  EXECUTE: "ВЫПОЛНИТЬ",
  M: "м",
  MAIN_TASK_EXPIRED:
    "Ура! Сегодняшнее 3-х часовое задание выполнено, возвращайтесь завтра :)",
  CONGRAT: "Позравляем!",
  GOT_EPC: "3-х часовое задание выполнено, бонусные epc начислены!",
  RETURN_TO_MALL: {
    TITLE_TOP: "Вернитесь в ТРЦ не теряйте прогресс",
    TITLE_BOTTOM: "Не потеряй прогресс вернись в ТРЦ в течении 5 мин",
    TIME_IS_UP: "Ваше время истекло. "
  },
  NO_INTERNET: "Нет соединения\nс интернетом",
  CARD_FAILED: "Срок выполнения этого задания уже истек",
  MAIN_TASK_FAILED: "Таймер задания на время обнулен :(",
  MAIN_TASK_FAILURE_REASON:
    "Было утеряно соединение, или вы покинули территорию ТРЦ",
  HTTP_ERRORS: {
    RUNTIME:
      "Время соединения с сервером истекло. Пожалуйста, попробуйте позже ",
    NOT_FOUND: "Ошибка. Данные по этому запросу не найдены",
    NOT_ENOUGHT_MONEY: "Ошибка. Ваших бонусов не достаточно для совершения этой покупки",
    SMTH_WENT_WRONG:
      "Ошибка. Пожалуйста, проверьте правильность заполненных данных",
    SERVER_ERROR: "Сервер временно недоступен. Пожалуйста, попробуйте позже"
  },
  SCANNER: {
    PLEASE: "Пожалуйста, поместите QR код \nвнутри области",
    BAD_QR: "QR код не соответствует заданию",
    TEXT: "Сканирование начнется автоматически",
    TYPE: "Фото",
    REMOVE: "Удалить",
    SEND: "Отправить"
  },
  CAMERA_PERMISSION:
    "Нам нужно ваше разрешение на использование телефона с камерой",
  TASKS: "Задания:",
  NO_TASKS: "К сожалению, в данный момент у нас нет заданий для вас",
  MISSION: {
    SUCCESS: "Задание выполнено!",
    CASH: "Вам начислено",
    NO_SUBMISSIOMS:
      "Отсутствуют задания в данной миссии. Пожалуйста, обратитесь к администратору."
  },
  CASH: {
    TITLE: "Ваши бонусы:",
    BUTTON: "СФОРМИРОВАТЬ QR",
    NO_CASH: "В этом ТРЦ нет доступных товаров",
    NO_CASH_SMILE: "¯\\_(ツ)_/¯"
  },
  QRCODE: {
    TITLE: "QR код сформировано. \nСумма вашей покупки - ",
    SELLER: "Покажите его продавцу и получите свои покупки",
    PROCESS: "Ваш заказ в обработке, \nожидайте..."
  },
  TRADE: {
    DATE: "Дата:",
    SUCCESS: "Чек",
    FAIL: "Отмена",
    SUCCESS_MESSAGE:
      "К сожалению, некоторые выбранные вами товары не были подтверждены. Попробуйте заказать их позже.",
    FAIL_MESSAGE:
      "К сожалению, выбранные вами товары не были подтверждены. Попробуйте повторить заказ позже.",
    CANCEL: "Отменено",
    RESULT: "ИТОГ"
  },
  PROFILE_PAGE: {
    EXIT_TO_START: "Вы уверены, что хотите выйти?",
    DECLINE: "Отмена",
    EXIT: "Выйти",
    EDIT: "Редактировать",
    CHOOSE_AVATAR: "Выберите аватар",
    EDIT_PHOTO: "Изменить фото",
    LOAD_PHOTO: "Загрузить фото",
    ACCEPT: "Применить",
    ALERT_EMPTY: "Поле имени не может быть пустым.",
    ALERT_TOO_LONG_BASE64: "Выбранное вами фото слишком большое.",
    ALERT_NOT_SAVED_DATA:
      "У вас есть несохраненные изменения. Вы действительно хотите отменить?",
    YES: "   Да   ",
    NO: "   Нет   "
  },
  HISTORY_PAGE: {
    GETTED: "Полученные\nбонусы",
    LOST: "Потраченные\nбонусы",
    ALL_BONUSES_RECEIVED: "Сумма всех полученных бонусов:",
    ALL_BONUSES_SPENT: "Сумма всех потраченных бонусов:",
    NO_HISTORY: "Ваша история пока пуста",
    NO_HISTORY_SMILE: "¯\\_(ツ)_/¯"
  },
  INFO_PAGE: {
    WATCH: "Смотреть ролик"
  }
};
