export const RU = {
  TITLE: "EpocketCash",
  PROFILE: "Профиль",
  CASHOUT: "Обналичить",
  SHOP: "Карта",
  INSTAGRAM: " Instagram ",
  FACEBOOK: " Facebook ",
  HISTORY: "Кошельки",
  INFO: "Инфо",
  MALE_SEX: "мужской",
  FEMALE_SEX: "женский",
  ATTENTION: "Внимание!",
  BACK: "Назад",
  CONNECT_SOCIAL: "Подключи соцсети и стань богаче!",
  LOCATION_VIRGIN: "Включи геолокацию и получи свои первые деньги",
  LOCATION_DISABLED: "Для дальнейших действий в приложении требуется включить геолокацию",
  LOCATION_ENABLE: "ВКЛЮЧИТЬ ГЕОЛОКАЦИЮ",
  DEVICE_SETTINGS: "Настройки",
  DEVELOPER_ENABLED: "Приложением запрещено пользоваться пока устройство находится в режиме разработчика",
  DATE_ABUSED: "Приложением запрещено пользоваться пока время на устройстве не совпадает с вашим локальным временем. \n Исправьте настройки даты и времени на вашем устройстве.",
  ROOT_ENABLED_ANDROID: "или на устройстве были получены root-права.",
  ROOT_ENABLED_IOS: "или на устройстве был установлен Jailbreak.",
  SIGN_UP_TITLE: "Регистрация",
  GO_TO_SIGNIN: "У МЕНЯ УЖЕ ЕСТЬ УЧЕТНАЯ ЗАПИСЬ",
  START_TITLE: "Зарабатывайте проводя время\nв торговом центре",
  MOBILE_NUMBER: "Введите ваш номер телефона",
  ENTER_NAME: "Введите ваше имя",
  FIRST_LAST_NAME: "Давайте познакомимся",
  SIGN_UP: "Зарегистрироваться",
  SIGN_IN: "Войти",
  NAMES: "Имя, Фамилия",
  PHONE_MASK: "- -  - - - - - -  - - - -",
  ACCEPT: "ПОДТВЕРДИТЬ",
  NOT_IN_ZONE: "Вы вне зоны",
  CODE_SENT: "На ваш номер телефона отправлен 6-ти значный код",
  ENTER_CODE: "Введите его для подтверждения регистрации",
  ENTER_CODE_SIDN_IN: "Введите его для подтверждения входа",
  CHECK_CODE: "Проверьте правильность кода",
  CODE_MASK: "- - - - - -",
  SING_UP_SUCCESS: "Регистрация прошла успешно!",
  USE_YOUR_PHONE: "Используйте ваш номер телефона для входа в приложение",
  OK: "OK",
  REPEAT: "Повторить",
  SIGN_IN_TITLE: "Вход",
  NUMBER_EXISTS: "Данный номер уже есть в базе",
  NUMBER_NOT_EXISTS: "Данного номера нет в базе. Зарегистрируйтесь",
  SOME_ERROR: "Что-то пошло не так :(",
  YOU_ARE_HERE: "Вы тут:",
  YOUR_BONUS: "Ваши бонусы:",
  EPC: "epc",
  FOR_BEING_IN_MALL: "За пребывание в ТРЦ",
  TIME_STARTED: "Время пошло...",
  NOT_IN_MALL: "Вы вне зоны ТРЦ.",
  EXECUTE: "ВЫПОЛНИТЬ",
  M: "м",
  MAIN_TASK_EXPIRED:
    "Ура! Сегодняшнее 3-х часовое задание выполнено, возвращайтесь завтра :)",
  CONGRAT: "Поздравляем!",
  GOT_EPC: "Вам начислено ",
  FOR_TRC: " за пребывание в ТРЦ",
  COME_TOMMOROW: "Приходите завтра, чтобы заработать больше.",
  RETURN_TO_MALL: {
    TITLE_TOP: "Вернитесь в зону действия ТРЦ в течении 5 мин, чтобы не потерять прогресс.",
    TIME_IS_UP: "Ваше время истекло."
  },
  DASHBOARD_LIST: {
    TASKS_TAB_TITLE: "Задания",
    POSTS_TAB_TITLE: "Посты",
    CONNECT: "Подключите свой",
    ACCOUNT_AND_GET: "аккаунт и получите",
    WILL_GET: "Вы получите ",
    OVER: " через",
    DD: "дня",
    HH: "часа",
    MM: "минут"
  },
  NO_INTERNET: "Нет соединения\nс интернетом",
  CARD_FAILED: "Срок выполнения этого задания уже истек",
  MAIN_TASK_FAILED: "Таймер задания на время обнулен :(",
  MAIN_TASK_FAILURE_REASON:
    "Было утеряно соединение или вы покинули территорию ТРЦ",
  HTTP_ERRORS: {
    RUNTIME:
      "Время соединения с сервером истекло. Пожалуйста, попробуйте позже ",
    NOT_FOUND: "Ошибка. Данные по этому запросу не найдены",
    NOT_ENOUGHT_MONEY: "Ошибка. Ваших бонусов недостаточно для совершения этой покупки",
    SMTH_WENT_WRONG:
      "Ошибка. Пожалуйста, проверьте правильность заполненных данных",
    SERVER_ERROR: "Сервер временно недоступен. Пожалуйста, попробуйте позже",
    PEOPLE_LIMIT: "К сожалению, задание на время не доступно",
    PERSONAL_LIMIT: "На сегодня задание на время выполнено",
  },
  SCANNER: {
    PLEASE: "Пожалуйста, поместите QR код \nвнутри области",
    BAD_QR: "QR код не соответствует заданию",
    TEXT: "Сканирование начнется автоматически",
    TYPE: "Фото",
    REMOVE: "Удалить",
    SEND: "Отправить"
  },
  CAMERA_PERMISSION:
    "Нам нужно ваше разрешение на использование камеры телефона",
  TASKS: "Задания:",
  NO_TASKS: "К сожалению, в данный момент у нас нет заданий для вас",
  NO_POSTS: "В данный момент у Вас нет публикаций в процессе обработки",
  MISSION: {
    SUCCESS: "Задание выполнено!",
    CASH: "Вам начислено",
    NO_SUBMISSIOMS:
      "Отсутствуют задания в данной миссии. Пожалуйста, обратитесь к администратору",
    SUBMISSION_3: '* Отправьте фото в инстаграм на 24 часа и получите дополнительное вознаграждение.',
    MORE_MONEY: "+ 10 " + "epc" + "",
    MORE_TEXT: 'Получите больше, поделившись фото с друзьями!',
    MORE_DESC: 'Отправьте фото в свой Instagram и не удаляйте его в течении 24 часов',
    EARN_MORE: 'ЗАРАБОТАТЬ БОЛЬШЕ',
    SKIP: 'Пропустить',
    HASHTAGS_MESSAGE: 'Хэштеги скопированы в буфер обмена вставьте их в Вашу публикацию',
    POST_ERROR_MESSAGE: 'Ошибка! Нет возможности проверить публикацию',
    POST_SUCCESS_MESSAGE: 'Ваш пост успешно опубликован',
    POST_NO_PUBLISH_MESSAGE: 'Ваш пост не был опубликован',

  },
  CASH: {
    TITLE: "Баланс: ",
    YOUR_TITLE: "Ваш баланс: ",
    BUTTON: "СФОРМИРОВАТЬ QR",
    NO_CASH: "В этом ТРЦ нет доступных товаров",
    NO_CART: "Ваша корзина пуста",
    NO_CASH_SMILE: "¯\\_(ツ)_/¯",
    PARTNERS: "Наши партнеры: "
  },
  PARTNERS: {
    HERE_YOU_CAN_BUY_BY_EPC: "Тут вы можете приобрести товары за EPC",
    ONLINE_SHOPS: "Online магазины",
    SHOPS: "магазины",
    NO_SHOPS: "В вашем регионе нет доступных партнеров"
  },
  QRCODE: {
    TITLE: "QR код сформирован. \nСумма вашей покупки - ",
    SELLER: "Покажите его продавцу и получите свои покупки",
    PROCESS: "Ваш заказ в обработке, \nожидайте..."
  },
  TRADE: {
    DATE: "Дата:",
    SUCCESS: "Чек",
    FAIL: "Отмена",
    SUCCESS_MESSAGE:
      "К сожалению, некоторые выбранные вами товары не были подтверждены. Попробуйте заказать их позже.",
    FAIL_MESSAGE:
      "К сожалению, выбранные вами товары не были подтверждены. Попробуйте повторить заказ позже.",
    CANCEL: "Отменено",
    RESULT: "ИТОГ"
  },
  MAP_TABS: {
    SHOP: "Точки\nвыдачи",
    TASK: "Задания\nи бонусы",
    DISCOUNT: "Дисконт\nцентры",
    OUR_PARTNERS: "Наши\nпартнеры"
  },
  MAP: {
    TASKS: "Задания",
    CART: "Корзина",
    WILL_BE_ACTIVE: "Будет активно",
    MAKE_PREORDER: "Сделать предзаказ",
    LIST_PRODUCTS: "Список товаров",
    CONNECT_INSTA: "Подключите Instagram и получите ",
    CONNECT_FACEBOOK: "Подключите Facebook и получите "
  },
  PARTNER_SCREEN: {
    SHOW_THIS_CODE: "Покажите этот код на кассе для оплаты EPC",
    COMISSION_IS_PAYED_IN: "Комиссия оплачивается в ",
    AND_IT_IS: " и составляет ",
    PERCENT_FROM_TOTAL_PRICE: " % от суммы счета"
  },
  PROFILE_PAGE: {
    EXIT_TO_START: "Вы уверены что хотите выйти?",
    DECLINE: "Отмена",
    DECLINE_2: "Отменить",
    EXIT: "Выйти",
    EDIT: "Редактировать",
    ADD_DATA: "Заполнить профиль",
    INSTA: "Instagram",
    CHOOSE_AVATAR: "Выберите аватар",
    EDIT_PHOTO: "Изменить фото",
    LOAD_PHOTO: "Загрузить фото",
    ACCEPT: "Применить",
    ALERT_EMPTY: "Вы заполнили не все данные. Добавьте фото, укажите Ваше имя, дату рождения и пол",
    ALERT_TOO_LONG_BASE64: "Выбранное вами фото слишком большое",
    ALERT_NOT_SAVED_DATA:
      "У вас есть несохраненные изменения. Вы действительно хотите отменить?",
    YES: "   Да   ",
    NO: "   Нет   ",
    PHONE: "Телефон",
    BIRTHDAY: "Дата рождения",
    ENTER_BIRTHDAY: "Введите дату рождения",
    SEX: "Пол",
    MALE: "мужской",
    FEMALE: "женский",
    NOT_ENOUGHT_SUB: "Вам до активации в системе не хватает",
    SUBS: " подписчиков",
    ALREADY_ACCOUNT: "Этот аккаунт уже привязан к другому пользователю"
  },
  HISTORY_PAGE: {
    GETTED: "Полученные бонусы",
    LOST: "Потраченные бонусы",
    ALL_BONUSES_RECEIVED: "Сумма всех полученных бонусов:",
    ALL_BONUSES_SPENT: "Сумма всех потраченных бонусов:",
    NO_HISTORY: "Ваша история пока пуста",
    NO_HISTORY_SMILE: "¯\\_(ツ)_/¯",
    SHOW_THIS_BARCODE: "Покажите этот штрих-код на кассе для оплаты"
  },
  INFO_PAGE: {
    INFO_TITLE: `
    Хочешь провести свое время с выгодой?
    Посети магазины близлежащего ТРЦ с нашим приложением.
    Пока Вы заняты выбором гардероба - мы увеличиваем Ваши скидки и бонусы от шопинга.
    Как это работает?
    Вы решили посетить магазин. Выберите в приложении интересующий Вас ТРЦ и отправляйтесь на шопинг. Пока вы гуляете по территории ТРЦ, посещаете магазины, салоны и рестораны, указанные в приложении, мы начисляем Вам бонусы или персональные скидки. На накопленные бонусы Вы можете приобрести товары, в магазинах участниках программы, или устав, отправиться в ресторан и выпить чашечку кофе с десертом.
    Приводите друзей и получайте дополнительные бонусы.
    Сыграйте в квест посещений, сделайте фото, разместите на своей страничке и получайте не только удовольствие от проведенного времени, но и дополнительную выгоду от посещения.
    Мы платим Вам за Ваше время. Скачайте приложение, выберите место, где интереснее всего провести свое время и получайте бонусы просто во время прогулок по супермаркету. С Epocketcash Вы будете проинформированы о новинках, дисконтах и акциях раньше других. Вы сможете обменять свое время на подарки от магазинов – участников. С Epocketcash Вы сможете получать доход:
    - за время, проведенное на территории ТРЦ;
    - за посещение интересующих магазинов;
    - за размещение фотографий на своей страничке;
    - за приглашение друзей.
    Если Вы хотите провести свое время не только тратя, но и с выгодой, – используйте наше приложение каждый раз, когда идете за покупками.`
  },
  PUSH_MESSAGE: {
    PUSH_1: 'Ваше время стоит денег. Вам начислено ___' + "epc",
    PUSH_2: "Не трать время впустую. Преврати его в ценность",
    PUSH_3: "Еще чуть – чуть и Вы станете богаче ",
    PUSH_4: "Поздравляем. Вы начали активность",
    PUSH_5: "Вы покинули зону активности, вернитесь для продолжения начислений"
  },
  PROFILE_SETTINGS: {
    SETTINGS: "Настройки",
    EDIT_PROFILE: "Редактировать профиль",
    INSTAGRAM: "Instagram",
    INSTAGRAM_ADDITIONAL: "Можно подключить при наличии 50 подписчиков",
    ADD: "Подключить",
    REMOVE: "Отключить",
    EXIT: "Выход"
  },
  GAME: {
    ZIFI: {
      MORE_GAMES: "Открой больше игр!",
      PLAYFUL: "Zifi хочет играть!",
      BORING: "Zifi скучно",
      TOO_LONG: "Долго. Zifi стало скучно",
      SHOCKED: "Zifi в восторге!",
      FAILED: "А вот и не угадал!",
      WAIT: "Так долго ждать?"
    },
    GAME_TITLE: "Игра",
    CONFIRM: "Подтвердить",
    SORRY_TODAY: "к сожалению на сегодня",
    LOCK: "Чтобы продолжить играть, необходимо посетить ближайший ТРЦ",
    NO_GAMES: "игр больше нет",
    GAMES_FOR_TODAY: "игр доступно на сегодня",
    START: "Старт",
    COST_TEXT: "задание на",
    GET_EPC: "Можете получить " + "EPC" + " посетив ближайший ТРЦ",
    VISIT_PARTNERS: "Посети сайт партнеров",
    VISIT_NEAREST_ONE: "Или посети ближайший ТРЦ",
    RESULT: {
      CONGRATS: "Поздравляем!",
      YOU_WON: "Вы выиграли",
      CONTINUE: "Продолжить",
      CONTINUE_PLAY: "Продолжить игру",
      SEND_TO_INST: "Отправьте фото с правильными ответами в свой инстаграм и не удаляйте его в течении 3-х дней",
      PUBLISH_AND_CONTINUE: "Опубликовать и продолжить",
      WAIT_: "Подождать ",
      MIN: " мин",
      VISIT_WEBSITE: "Посетить сайт и продолжить",
      MORE_MONEY: '+ 1 LIFE',
      MORE_TEXT: 'Получите еще 1 возможность пройти игру, поделившись фото с друзьями!',
      MORE_DESC: 'Отправьте фото в свой Instagram и не удаляйте его в течении 24 часов',
      EARN_MORE: 'ПОПРОБОВАТЬ ЕЩЕ РАЗ',
      SKIP: 'Пропустить',
      HASHTAGS_MESSAGE: 'Хэштеги скопированы в буфер обмена, вставьте их в Вашу публикацию',
      POST_ERROR_MESSAGE: 'Ошибка! Нет возможности проверить публикацию',
      POST_SUCCESS_MESSAGE: 'Ваш пост успешно опубликован',
      POST_NO_PUBLISH_MESSAGE: 'Ваш пост не был опубликован',
      STAY_ON_WEBSITE_FOR_3_MIN: "Проведи на сайте 3 мин.",
      LOOK_WHAT_TO_BUY: "Посмотри какие товары ты cможешь приобрести за EPC"
    }
  },
  CASHOUT_LIST: {
    POSITIONS_1: "позиция",
    POSITIONS_2: "позиции",
    POSITIONS_3: "позиций",
    LIST_OF_PRODUCTS: "Список",
    CART: "Корзина"
  },
  NO_INST_INSTALLED: "Необходимо установить приложение Instagram для публикации.",
  UNABLE_TO_POST: "Невозможно опубликовать запись",
  PERMISSON: {
    STORAGE_PERMISSON_TITLE: "EpocketCash необходим доступ к файлам",
    STORAGE_PERMISSON_MESSAGE: "Доступ необходим для совершения поста в Instagram.",
  },
  REF_LINK: {
    GET_EPC: "EPC" + " за друга",
    FOR_YOU_AND_YOUR_FRIEND: "EPC" + " тебе и другу за приглашение",
    COPY: "Копировать ссылку",
    FACEBOOK: "Facebook",
    FACEBOOK_MESSENGER: "Facebook Messenger",
    WHATSAPP: "Whatsapp",
    INSTAGRAM: "Instagram Direct",
    VIBER: "Viber",
    TELEGRAM: "Telegram",
    MORE: "Еще",
    COPY_MESSAGE: 'Ссылка скопирована в буфер обмена, вставьте ее в Вашу публикацию',
    ADDITIONAL_SHARING_TEXT: "Давай вместе зарабатывать в Epocketcash. Активируй аккаунт по ссылке и мы сразу получим по "
  }
};