Repository: Buongiorno007/epocket
Catalog: ios/*.lproj/InfoPlist.strings
Languages: ru

# NSAppleMusicUsageDescription
source: EpocketApp would like access to apple music (for listening to music)
ru: Предоставьте пожалуйста доступ к музыке

# NSBluetoothPeripheralUsageDescription
source: EpocketApp would like access to bluetooth to connect to your peripheral devices
ru: Предоставьте пожалуйста доступ к Bluetooth для доступа к периферийным устройствам

# NSCalendarsUsageDescription
source: EpocketApp would like to use your calendar
ru: Предоставьте пожалуйста доступ к календарю

# NSCameraUsageDescription
source: EpocketApp would like to use your camera. To add a photo to your profile and to your tasks
ru: Предоставьте пожалуйста доступ к камере. Нам это нужно для добавления фото к вашему заданию

# NSLocationAlwaysAndWhenInUseUsageDescription
source: The main purpose of the application is to check users on geo-positions. According to geopositions the app provides to users info about possibilities how its possible to get services from the app.
ru: Основная цель приложения отслеживать координаты пользователя. Основываясь на геопозиции мы предоставляем полный объем функционала приложения

# NSLocationAlwaysUsageDescription
source: The main purpose of the application is to check users on geo-positions. According to geopositions the app provides to users info about possibilities how its possible to get services from the app.
ru: Основная цель приложения отслеживать координаты пользователя. Основываясь на геопозиции мы предоставляем полный объем функционала приложения

# NSLocationWhenInUseUsageDescription
source: The main purpose of the application is to check users on geo-positions. According to geopositions the app provides to users info about possibilities how its possible to get services from the app.
ru: Основная цель приложения отслеживать координаты пользователя. Основываясь на геопозиции мы предоставляем полный объем функционала приложения

# NSMicrophoneUsageDescription
source: EpocketApp would like to your microphone
ru: Предоставьте пожалуйста доступ к микрофону

# NSMotionUsageDescription
source: Please provide access to the Â motion. Motion information is required by the application to determine the movement and provision of services using the application
ru: Предоставьте пожалуйста доступ к движению для записи вашей активности. Нам это нужно для корректного создания параметров для выполнения Вашего задания

# NSPhotoLibraryAddUsageDescription
source: EpocketApp would like to save photos to your photo gallery. To add a photo to your profile and to your tasks
ru: Предоставьте пожалуйста доступ к фотогалерее. Для добавлений фото к вашему заданию

# NSPhotoLibraryUsageDescription
source: EpocketApp would like access to your photo gallery. To add a photo to your profile and to your tasks
ru: Предоставьте пожалуйста доступ к фотогалерее. Для добавлений фото к вашему заданию

# NSSpeechRecognitionUsageDescription
source: EpocketApp would like access to speech recognition to recognite your speech
ru: Предоставьте пожалуйста доступ к распознаванию речи
